# import the Fraudit libraries
from fraudit import *

# import commonly-needed built-in libraries
import string, sys, re, random, os, os.path
# import data handling libraries
import pandas as pd
import numpy as np

for i in range(len(항목별_테이블)):
    for j in range(항목별_테이블[i]['내용연수'][0]):
        if j == 0 :
            항목별_테이블[i]['감가상각대상금액'][0] = 항목별_테이블[i]['취득원가'][0]- 항목별_테이블[i]['잔존가치'][0]
            항목별_테이블[i]['상각률'][0] = 1/항목별_테이블[i]['내용연수'][0] 
            항목별_테이블[i]['감가상각비'][0] = 항목별_테이블[i]['감가상각대상금액'][0] * 항목별_테이블[i]['상각률'][0]
            항목별_테이블[i]['감가상각누계액'][0] = 항목별_테이블[i]['감가상각비'][0]*(j+1)
            항목별_테이블[i]['장부금액'][0] = 항목별_테이블[i]['취득원가'][0] - 항목별_테이블[i]['감가상각누계액'][0]

        elif j >= 1:
            if 항목별_테이블[i]['잔존가치'][0] < 항목별_테이블[i]['장부금액'][j-1]:
                항목별_테이블[i].append(항목 = 항목별_테이블[i]['항목'][0],
                                    취득원가 = 항목별_테이블[i]['취득원가'][0],
                                    감가상각대상금액 = 항목별_테이블[i]['취득원가'][0] -항목별_테이블[i]['잔존가치'][0],
                                    상각률 = 1/항목별_테이블[i]['내용연수'][0],
                                    감가상각비 = 항목별_테이블[i]['감가상각대상금액'][0]*항목별_테이블[i]['상각률'][0],
                                    감가상각누계액 = 항목별_테이블[i]['감가상각비'][0]*(j+1),
                                    장부금액 = 항목별_테이블[i]['취득원가'][0] - 항목별_테이블[i]['감가상각비'][0]*(j+1)
                                    )
                                    